Merge pull request #10 from KrishnaAnnavaram/doc
Doc
